#!/bin/bash

set -euo pipefail

number=$((RANDOM % 100 + 1))
#Задано в так званому C style оскільки в скрипті зазначено що потрібно використовувати /bin/bash оточення
#додатково можилво задати число за допомогою urandom або random наступним чином od -An -N4 -tu4 /dev/urandom | awk '{print ($1 % 100) + 1}' але для цією задачі це недоцільно оскільки швидкість обробки інформації для цих девайсів нижча ніж для змінної $RANDOM  
attempts=5

echo "Вгадайте число від 1 до 100."
echo "У вас є $attempts спроб. Потрібно вводити лише цілі додатні числа"

for ((i = 1; i <= attempts; i++)); do 
    read -p "Спроба $i/$attempts. Введіть число: " guess

    if [[ guess -lt number ]]; then
        echo "Занадто низько."
    elif [[ guess -gt number ]]; then
        echo "Занадто високо."
    else
        echo "Вітаємо! Ви вгадали правильне число."
        exit 0
    fi
done

echo "Вибачте, у вас закінчилися спроби. Правильним числом було $number, спорбуйте знову"
